/*
   Домашнее задание по лекции №1
*/

#include "stdio.h"

int main(void)
{
	//Вывести на экран текст "Hello world!"
	printf("Hello world!\n");
	
	//Вывести на экран текст лесенкой
	printf("Let's\ngo\n\t\tto walk\n");
	
	//Вывести на экран рисунок из букв
	printf("   *\n  ***\n *****\n*******\n");
	printf(" HH HH\n ZZZZZ\n");
	return 0;
}
